package by.it.group351051.a_hancharyk.lesson03;

import java.io.File;
import java.io.FileNotFoundException;
import java.util.HashMap;
import java.util.Scanner;

// Lesson 3. B_Huffman.
// Восстановите строку по её коду и беспрефиксному коду символов.

// В первой строке входного файла заданы два целых числа
// kk и ll через пробел — количество различных букв, встречающихся в строке,
// и размер получившейся закодированной строки, соответственно.
//
// В следующих kk строках записаны коды букв в формате "letter: code".
// Ни один код не является префиксом другого.
// Буквы могут быть перечислены в любом порядке.
// В качестве букв могут встречаться лишь строчные буквы латинского алфавита;
// каждая из этих букв встречается в строке хотя бы один раз.
// Наконец, в последней строке записана закодированная строка.
// Исходная строка и коды всех букв непусты.
// Заданный код таков, что закодированная строка имеет минимальный возможный размер.
//
//        Sample Input 1:
//        1 1
//        a: 0
//        0

//        Sample Output 1:
//        a


//        Sample Input 2:
//        4 14
//        a: 0
//        b: 10
//        c: 110
//        d: 111
//        01001100100111

//        Sample Output 2:
//        abacabad

public class B_Huffman {


    public StringBuilder Encoding(String shifr, HashMap<String, Character> codes)
    {
        StringBuilder result=new StringBuilder();
        int i = 0;
        String code = "";
        while(i < shifr.length())
        {                      //shifr[i]
            code  = code + shifr.charAt(i);//прибвляем к code цифру из строки
            if(codes.containsKey(code))//если ключ есть в словаре
            {
                // System.out.println(code);
                result.append(codes.get(code));//то добавляем букву из словаря к строке резульату(расшифрованной)
                code = "";
            }
            i++;
        }
        return result;
    }

    String decode(File file) throws FileNotFoundException {
        StringBuilder result=new StringBuilder();
        //прочитаем строку для кодирования из тестового файла
        Scanner scanner = new Scanner(file);
        Integer count = scanner.nextInt();//Прочитали первое число
        Integer length = scanner.nextInt();//Прочитали втрое число

        HashMap<String, Character>  codes = new HashMap<String, Character>();
        scanner.nextLine();//перешли к след строке

        //считываем буквы и их коды(count раз)
        for(int i = 0; i < count; i++)
        {
            //читаем строку из файла
            String line = scanner.nextLine();

            Character c = line.charAt(0);//забрали букву из строки
            String code = line.split(": ")[1];//забрали код буквы
            codes.put(code, c);//добавдение в словарь ключ:  значения ( буква: код)

        }
        String shifr = scanner.nextLine();

        //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! НАЧАЛО ЗАДАЧИ !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1
        //тут запишите ваше решение
        result = Encoding(shifr, codes);

        //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! КОНЕЦ ЗАДАЧИ !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1
        return result.toString(); //01001100100111
    }

    public static void main(String[] args) throws FileNotFoundException {
        String root = System.getProperty("user.dir") + "/src/";
        File f = new File(root + "by/it/a_khmelev/lesson03/encodeHuffman.txt");
        B_Huffman instance = new B_Huffman();
        String result = instance.decode(f);
        System.out.println(result);
    }


}
